#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.load_gh_audit_log_source: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.load_gh_audit_log_source: Read complete after 0s [id=8f98981d2dddcce0a92684e5cedcd5645cf4e707]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=795832857450092111]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6469184184091429422]
module.fourkeys.google_storage_bucket.trigger_bucket: Refreshing state... [id=batch-gh-audit-logs]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 0s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.data.google_project.project: Read complete after 0s [id=projects/off-net-dev]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 0s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 0s [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket will be created
  + resource "google_storage_bucket" "batch_gh_log_function_bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "NORTHAMERICA-NORTHEAST1"
      + name                        = "off-net-dev-batch-gh-log-function"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.fourkeys.google_storage_bucket.function_bucket will be created
  + resource "google_storage_bucket" "function_bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "NORTHAMERICA-NORTHEAST1"
      + name                        = "off-net-dev-function-gh-log-source"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.fourkeys.google_storage_bucket.trigger_bucket will be destroyed
  # (because google_storage_bucket.trigger_bucket is not in configuration)
  - resource "google_storage_bucket" "trigger_bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - force_destroy               = false -> null
      - id                          = "batch-gh-audit-logs" -> null
      - labels                      = {} -> null
      - location                    = "NORTHAMERICA-NORTHEAST1" -> null
      - name                        = "batch-gh-audit-logs" -> null
      - project                     = "off-net-dev" -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/batch-gh-audit-logs" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://batch-gh-audit-logs" -> null
    }

  # module.fourkeys.google_storage_bucket_object.load_gh_audit_log_zip will be created
  + resource "google_storage_bucket_object" "load_gh_audit_log_zip" {
      + bucket         = "off-net-dev-function-gh-log-source"
      + content        = (sensitive value)
      + content_type   = "application/zip"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "src-072b4875de4a6fa60b16dbeed4805afa.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/tmp/batch_gh_audit_log.zip"
      + storage_class  = (known after apply)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*